   SELECT FD-PFM ASSIGN TO DISK
          ORGANIZATION         IS INDEXED
          ACCESS MODE          IS DYNAMIC
          RECORD KEY           IS KEY1-PFM
          FILE STATUS          IS ST-PFM.
