   SELECT FD-USER ASSIGN TO DISK
          ORGANIZATION         IS INDEXED
          ACCESS MODE          IS DYNAMIC
          RECORD KEY           IS KEY1-USR
          ALTERNATE RECORD KEY IS KEY2-USR
          FILE STATUS          IS ST-USR.
