   SELECT FD-PFU ASSIGN TO DISK
          ORGANIZATION         IS INDEXED
          ACCESS MODE          IS DYNAMIC
          RECORD KEY           IS KEY1-PFU
          FILE STATUS          IS ST-PFU.
          